src/modules/certification/lifecycle/performance-tests/lifecycle-performance.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL }}"
  phases:
    - duration: 60
      arrivalRate: 2
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: Ramp up
    - duration: 180
      arrivalRate: 10
      name: Load test
  defaults:
    headers:
      Authorization: "Bearer {{ authToken }}"
      Content-Type: application/json
      Accept: application/json
  processor: "./lifecycle-performance.processor.cjs"

scenarios:
  - name: Certificate lifecycle read flow
    flow:
      - function: "ensureAuthToken"
      - get:
          url: "/certification/certificates"
      - think: 1
      - get:
          url: "/certification/certificates/eligible"
      - think: 1
      - get:
          url: "/certification/certificates/overview/stats"
      - think: 1
      - get:
          url: "/certification/certificates/overview/charts"